-- пакетная вставка данных в базу данных cinemapark 

use cinemapark;

INSERT INTO photo (name) values
('holop.jpg'),
('terminator.jpg'),
('fix.jpg'),
('Saw.jpg'),
('Escape.jpg'),
('OceanFriends.jpg'),
('Bastards.jpg'),
('Policeman.jpg'),
('Bik.jpg'),
('Bort.jpg'),
('Petr.jpg'),
('Bur.jpg'),
('Shw.jpg'),
('Ham.jpg'),
('Naz.jpg'),
('Uon.jpg'),
('Clu.jpg'),
('Pit.jpg'),
('Ship.jpg'),
('Cam.jpg'),
('Bed.jpg'),
('Van.jpg'),
('Kim.jpg'),
('Sod.jpg'),
('Tar.jpg'),
('Kul.jpg');

INSERT INTO films (films_name, release_year, comments, duration, age_limit, photo_id) values
('Холоп', '2019', 'Очередной прорыв российского кинематографа', '1:35:22', '14+', 1),
('Терминатор Финал', '2020', 'Машина времени сломалась и Конора снова не спасти', '2:06:15', '18+', 2),
('Фиксики Революция', '2020', 'Им надоело чинить приборы', '1:16:04', '0+', 3),
('Пила 10', '2020', 'Маньяком снова окажется кто то другой', '1:44:01', '14+', 4),
('Еще один побег из куртника', '2018', 'От создателей "Побег из Шоушенка"', '1:26:49', '0+', 5),
('14 друзей Оушена', '2018', 'Старики взялись за старое', '2:08:44', '12+', 6),
('Славные ублюдки', '2020', 'Еще один исторический фильм, основанный на реальных событиях', '2:13:09', '18+', 7),
('Полицейский с рублевки 6', '2020', 'Демон вернулся', '6:20:00', '18+', 8);

INSERT INTO genre (name) values
('комедия'),
('фантастика'),
('ужасы'),
('мультфильм'),
('драма'),
('детектив'),
('документальный'),
('исторический'),
('сериал');

INSERT INTO movie_genres (genre_id, movie_id) values
(1, 1),
(2, 1),
(8, 1),
(2, 2),
(4, 3),
(3, 4),
(5, 4),
(4, 5),
(6, 5),
(5, 6),
(7, 7),
(8, 7),
(1, 8),
(9, 8),
(5, 8);

insert INTO actors (firstname, lastname, birthday, photo_id) values
('Милош', 'Бикович', '1988-01-13', 9),
('Александра', 'Бортич', '1994-09-24', 10),
('Александр', 'Петров', '1989-01-25', 11),
('Сергей', 'Бурунов', '1977-03-06', 12),
('Арнольд', 'Шварцнеггер', '1947-07-30', 13),
('Линда', 'Хэмилтон', '1956-07-26', 14),
('Дмитрий', 'Назаров', '1957-07-04', 15),
('Ли', 'Уоннел', '1977-01-17', 16),
('Джордж', 'Клуни', '1961-05-06', 17),
('Брэд', 'Питт', '1963-12-18', 18);

insert INTO producers (firstname, lastname, birthday, photo_id) values
('Клим', 'Шипенко', '1983-06-16', 19),
('Джеймс', 'Кэмерон', '1954-08-16', 20),
('Василий', 'Бедошвили', '1960-06-16', 21),
('Джеймс', 'Ван', '1977-02-27', 22),
('Юрий', 'Ким', '1984-10-30', 23),
('Стивен', 'Содерберг', '1963-01-14', 24),
('Квентин', 'Тарантино', '1963-03-27', 25),
('Илья', 'Куликов', '1981-08-07', 26);
 
INSERT INTO actors_filmography (actor_id, movie_id, `role`) values
(1, 1, 'leading role'),
(2, 1, 'leading role'),
(2, 8, 'supporting role'),
(3, 8, 'leading role'),
(4, 8, 'leading role'),
(4, 5, 'voice acting'),
(5, 2, 'leading role'),
(6, 2, 'supporting role'),
(7, 3, 'voice acting'),
(8, 4, 'leading role'),
(9, 6, 'leading role'),
(10, 6, 'leading role'),
(10, 7, 'leading role');

INSERT INTO producer_filmography (producer_id, movie_id) values
(1, 1),
(2, 2),
(3, 3),
(4, 4),
(5, 5),
(6, 6),
(7, 7),
(8, 8);

INSERT INTO users (login, email, password_hash, birthday) values
('total', 'total@mail.ru', 'c67c5a4a07ab24f605909ada5657d9ef668a0eab', '1988-01-15'),
('asdfg', 'asdfg@mail.ru', 'a2c66df23c8152b8659bec4a4bf54ba049bda74c', '1994-06-13'),
('qwerty', 'qwerty@mail.ru', 'db45d11c346a10897250eaf90e1fb40d946c803f', '1978-08-23'),
('pop', 'pop@mail.ru', '5c975a08c6134f83fa38162a0dfe6ba81fee129c', '1999-05-03'),
('agron', 'agron@mail.ru', '9476409909a91287cc81743e09b73e48e57d9661', '2001-01-24'),
('masterchief', 'masterchief@mail.ru', '54d92671cd47373eb965ae88e2903f6dfe5d01ca', '2002-11-11'),
('acula', 'acula@mail.ru', 'a900276d18e2a373259443951a3ade8cd8d289f6', '1981-02-23'),
('populyarniy', 'populyarniy@mail.ru', '2336156af1fc1a878f18fedded531e6603bb6d37', '1968-09-19'),
('corn', 'corn@mail.ru', 'd45faf7f36718ec188ecc2debd6d78f56ac73c91', '1988-01-01'),
('login', 'login@mail.ru', '1b62ed7647763cb92716ca6732280f090d90f15c', '1989-01-17'),
('privet', 'privet@mail.ru', '0386a3a69fc00fea2fef501960e92222b669265e', '1994-01-10'),
('lucker', 'lucker@mail.ru', '64a5c2c4f057a2ca0573a14ce1f52accda5676e6', '1999-01-22'),
('superman', 'superman@mail.ru', '05f57f2c683c091ac3127a2496423248a2f683fd', '2005-01-11');

INSERT INTO ratings (user_id, movie_id, rating, reviews) values
(1, 1, '7', ''),
(1, 3, '9', 'Дети были в восторге'),
(1, 8, '5', 'Возвращение не удалось'),
(3, 2, '4', ''),
(3, 4, '5', ''),
(3, 5, '7', ''),
(3, 6, '7', ''),
(4, 7, '9', 'Прям так всё и было'),
(4, 8, '8', 'Ура, снова все в сборе'),
(5, 4, '6', 'Страшный фильм'),
(6, 1, '8', ''),
(6, 3, '4', ''),
(6, 4, '6', ''),
(6, 6, '6', ''),
(6, 7, '10', ''),
(6, 8, '7', ''),
(7, 2, '6', ''),
(7, 3, '8', 'Очень познавательный мультфильм'),
(7, 6, '5', ''),
(8, 1, '9', ''),
(8, 2, '4', 'Арнольду пора на пенсию'),
(8, 4, '9', 'Потрясающий фильм'),
(8, 8, '7', ''),
(11, 1, '6', 'Наши не умеют снимать фильмы'),
(11, 5, '9', ''),
(12, 1, '7', ''),
(12, 2, '8', 'Все хают, а мне понравился'),
(12, 3, '9', ''),
(12, 4, '5', ''),
(12, 5, '6', ''),
(12, 6, '6', ''),
(12, 7, '9', 'В лучших традициях Тарантино'),
(12, 8, '10', ''),
(13, 2, '7', ''),
(13, 6, '8', 'Откуда у него столько друзей');

INSERT INTO favourites (user_id, movie_id) values
(1, 1),
(1, 3),
(2, 2),
(2, 3),
(5, 6),
(5, 7),
(5, 8),
(6, 1),
(6, 7),
(7, 3),
(7, 5),
(9, 8),
(10, 8),
(11, 5),
(11, 4),
(11, 8),
(12, 2),
(12, 3),
(12, 7),
(12, 8),
(13, 6),
(13, 7);




